Repository: arkryonia/ibackup
Catalog: foton/students/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Password
fr: Mot de passe

source: Class
fr: Classe

source: Choose your gender
fr: Choisissez vôtre sexe

source: Female
fr: Féminin

source: Male
fr: Masculin

source: Choose your type
fr: Choisissez votre Catégorie

source: Regular Student
fr: Ordinaire

source: Choose your marital status
fr: Choisissez votre Situation Matrimoniale

source: Single
fr: Célibataire

source: Maried
fr: Marié

source: Gender
fr: Sexe

source: (select country)
fr: Vôtre pays d'origine

source: Nationality
fr: Nationalité

source: Place of Birth
fr: Lieu de Naissance

source: Academic Year
fr: Année Académique

source: Marital Status
fr: Situation Matrimoniale

source: Sponsor or guardian full name
fr: Parain ou Sponsor ou Tuteur

source: Relationship with Sponsor or Guardian
fr: Relation avec Sponsor ou le Tuteur

source: Relation to Applicant
fr: Relation avec l'étudiant

source: Sponsor or Guardian Address
fr: Addresse du Sponsor ou Tuteur

source: Sponsor or Guardian Permanent Address
fr: Addresse du Sponsor ou Tuteur

source: Occupation
fr: Fonction du Sponsor ou Tuteur

source: Sponsor or Guardian Telphone
fr: Téléphone du Sponsor ou Tuteur

source: Sponsor or Guardian Email
fr: Email du Sponsor ou Tuteur

source: Registred
fr: Etudiant

source: Registreds
fr: Etudiants

source: Create Class
fr: Créer une Classe

source: Classes List
fr: Listes des Classes

source: Update Class
fr: Modifier la Classe

source: Students
fr: Étudiants

source: Admission
fr: Inscription

source: Add Student
fr: Ajoutez un Étudiant

source: Students
fr: Étudiants

source: Class
fr: Classe

source: Registration
fr: Enregistrement

source: Update Student
fr: Modifier

source: Register
fr: Enregistrer

source: Search
fr: Rechercher

source: Admission list
fr: Liste d'Inscription

source: Admission Succes
fr: Inscription Réussie

source: Admission Success
fr: Inscription Réussie

source: Print Admission Form
fr: Imprimer le formulaire d'Inscription
