Repository: arkryonia/ibackup
Catalog: foton/degrees/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Program Bachelor
fr: Programme Licence

source: Create License
fr: Ajouter une Licence

source: Licenses
fr: Licence

source: Name
fr: Nom

source: Program File
fr: Programme en pdf

source: Update License
fr: Modifier la Licence

source: Create Master
fr: Ajouter un Master

source: Speciality
fr: Spécialité

source: No Master available!
fr: Pas de Master

source: Masters Options
fr: Options de Masters

source: No License available!
fr: Pas de Licence

source: Programs Master
fr: Programme Master
