Repository: arkryonia/ibackup
Catalog: foton/planning/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Planning
fr: Emploi du Temps

source: Plannings
fr: Emplois du Temps

source: PlanningItem
fr: Entrée d'emploi du temps

source: PlanningItems
fr: Entrées d'emploi du temps

source: Create Planning
fr: Ajouter

source: Planning of
fr: Emploi du Temps de

source: Add Item
fr: Ajouter une entrée

source: Classes List
fr: Classes

source: Update Planning
fr: Modifier

source: Are you sure you want to delete this planning item ?
fr: Êtes-Vous sûr de vouloir supprimer cette entrée ?

source: Delete this planning Item
fr: Supprimer cette entrée

source: Delete Item
fr: Supprimer

source: Update Item
fr: Modifier

source: Plannings list
fr: Liste d'Emplois du Temps
