Repository: arkryonia/ibackup
Catalog: foton/theme/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Toggle navigation
fr: Mieux connaître Irgib Africa

source: Update password
fr: Changer le mot de passe

source: Sign Out
fr: se déconnecter

source: Home
fr: Accueil

source: Programs
fr: Programmes

source: Degrees
fr: Niveaux

source: Doctorates
fr: Doctorat

source: Planning
fr: Emploi du Temps

source: Registration
fr: Inscription

source: Students
fr: Etudiants

source: Exams Result
fr: Résultats d'Examens

source: Courses
fr: Cours

source: Presentation
fr: Présentation

source: Blog Posts
fr: Articles

source: Blog Categories
fr: Categories

source: Events and News
fr: Événement et Nouvelles

source: Sc. Journal
fr: Journal Sc.

source: IRGIB AFRICA ADMINISTRATION
fr: ADMINISTRATION

source: Welcome to IRGIB AFRICA Administration Site!
fr: Bienvenu sur le site d'Administration

source: You can start working right now.
fr: Au travail!

source: Welcome to IRGIB AFRICA. You are now connected as
fr: Bienvenue à IRGIB-AFRCA. Vous êtes connectez en tant que

source: Logout
fr: Se Déconnecter

source: Admission
fr: Inscription

source: Results
fr: Résultats

source: Bachelor
fr: Licence

source: Doctorate
fr: Doctorat

source: Gallery of
fr: Gallerie de

source: IRGIB on Twitter
fr: Irgib Africa sur Twitter

source: Helpful Links
fr: Liens utiles

source: our blog
fr: Nôtre Blog

source: irgib news
fr: Nouvelles

source: irgib events
fr: Évènements

source: consult planning
fr: Emplois du Temps

source: galleries photos
fr: Galleries

source: contact us
fr: Nous Contacter

source: LOGOUT
fr: SE DÉCONNECTER

source: Login
fr: Connexion

source: All Right Reserved
fr: Tous droits réservés

source: Contact Irgib Africa University
fr: Contacter Irgib Africa University

source: General Contact Informations
fr: Informations de Contacts

source: Addresses
fr: Adresses

source: Location
fr: Localisation

source: follow on twitter
fr: Suivez Nous sur Twitter

source: follow on facebook
fr: Suivez Nous sur Facebook
