Repository: arkryonia/ibackup
Catalog: foton/presentation/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Title
fr: Titre

source: Content
fr: Contenu

source: Presentation
fr: Présentation

source: Create About
fr: Ajouter

source: About List
fr: Liste

source: Title
fr: Titre

source: Update About
fr: Modifier

source: Learn more about IRGIB Africa
fr: En Savoir plus sur Irgib Africa

source: Bachelor
fr: License

source: Irgib news
fr: Nouvelles

source: read more
fr: Lire la suite

source: Sorry, there is no new to display now. Thanks!
fr: Aucune Nouvelle

source: More News
fr: Plus de Nouvelles

source: Irgib events
fr: Évènements

source: Sorry, there is no event to display now. Thanks!
fr: Aucun Évènement

source: More Events
fr: Plus d'Évènements

source: Last post
fr: Dernières Publications

source: More Posts
fr: Plus de Publications

source: Create Item
fr: Créer

source: Items List
fr: Items

source: Update Item
fr: Modifier
