Repository: arkryonia/ibackup
Catalog: foton/galleries/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Gallery
fr: Gallerie

source: Add Photo
fr: Ajouter une Photo

source: Create Gallery
fr: Ajouter une Gallerie

source: Are you sure you want to delete this gallery ?
fr: Êtes vous sûr de vouloir supprimer cette Gallerie

source: Delete
fr: Supprimer

source: Delete Gallery
fr: Supprimer

source: Detail Photo
fr: Détails

source: Update this Photo
fr: Modifier la Photo

source: Galleries List
fr: Liste de Galleries

source: New Gallery
fr: Nouvelle gallerie

source: Update Gallery
fr: Modifier

source: Galleries list
fr: Liste des Galleries

source: IRGIB Africa's videos
fr: Vidéos
