Repository: arkryonia/ibackup
Catalog: foton/ejournal/locale/*/LC_MESSAGES/django.po
Languages: fr

source: title
fr: titre

source: abstract
fr: Résumé

source: issue
fr: parution

source: author
fr: auteur

source: keywords
fr: mots clés

source: By
fr: Par

source: Our Scientific Journal
fr: Nôtre Journal Scientifique

source: Read More
fr: Lire la suite

source: Recent Publications
fr: Publications Récentes

source: Create Magasine
fr: Ajouter un Magasine

source: Publications List
fr: Liste des Publications

source: Create Publication
fr: Ajouter une Publication

source: Update Publication
fr: Modifier

source: Create Sommary
fr: Ajouter un sommaire

source: Sommary List
fr: Liste des Sommaires

source: Title
fr: Titre

source: Update Magasine
fr: Modifier le Magasine
