Repository: arkryonia/ibackup
Catalog: foton/elearning/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Password
fr: Mot de passe

source: Allianza Registred
fr: Etudiant d'Allianza

source: Allianza Registreds
fr: Etudiants d'Allianza

source: Program Bachelor
fr: Programme des Bachelors

source: Create License
fr: Créer une License

source: Students
fr: Étudiants

source: Lecures
fr: Cours

source: Credits
fr: Crédits

source: Overview
fr: Introduction

source: Name
fr: Nom

source: Program File
fr: Fichier du programme

source: Update License
fr: Mise à jour

source: Add
fr: Ajouter

source: Add File
fr: Ajouter un Fichier Pdf ou Word

source: Add Image
fr: Ajouter une Image

source: Add Text
fr: Ajouter du Texte

source: Contents
fr: Contenus

source: Create Lecture
fr: Ajouter un cours

source: Lecture
fr: Cours

source: Update Lecture
fr: Modifier

source: Create Master
fr: Ajouter un Master

source: Speciality
fr: Spécialités

source: No Master available!
fr: Pas de programme Master

source: Masters Options
fr: Opions

source: No License available!
fr: Pas de License

source: Programs Master
fr: Programme Master

source: Add or Edit Modules
fr: Ajouter ou Modifier des Modules

source: Enroll to
fr: S'Inscrire à

source: Our Programs
fr: Nos Programme

source: Programs
fr: Programmes

source: Bachelors
fr: Licenses

source: details
fr: détails

source: view
fr: détails

source: Students
fr: Étudiants

source: Status
fr: Actif

source: Program
fr: Programme

source: Create Semester
fr: Ajouter un Semestre

source: Semester
fr: Semestre
